# Operations

In [2]:
import numpy as np
import pandas as pd

In [8]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,555],
                  'col3':['abc','asl','xyz','adl']})

In [9]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  asl
2     3   666  xyz
3     4   555  adl

In [10]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [11]:
df['col2'].nunique()

3

In [12]:
df['col2'].value_counts()

col2
555    2
444    1
666    1
Name: count, dtype: int64

In [18]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  xyz
3     4   555  adl

In [26]:
df['col2']==555

0    False
1     True
2    False
3     True
Name: col2, dtype: bool

In [27]:
def times2(x):
    return x*2

In [30]:
####custom function
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [32]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [33]:
####custom lambda expression
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3    1110
Name: col2, dtype: int64

In [36]:
####return list of column names 
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [37]:
####return info of index
df.index

RangeIndex(start=0, stop=4, step=1)

In [39]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
1     2   555  asl
3     4   555  adl
2     3   666  xyz

In [41]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [50]:
####new dataframe
df2 = pd.DataFrame({'A':['boc','boc','boc','chi','chi','chi'],
                  'B':['ONE','ONE','TWO','TWO','ONE','ONE'],
                  'C':['x','y','x','y','x','y'],
                  'D':[1,3,2,5,4,1]})

In [51]:
df2

     A    B  C  D
0  boc  ONE  x  1
1  boc  ONE  y  3
2  boc  TWO  x  2
3  chi  TWO  y  5
4  chi  ONE  x  4
5  chi  ONE  y  1

In [54]:
#pivot tables
#pivottables(arguments:values,index,columns)
df2.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
boc ONE  1.0  3.0
    TWO  2.0  NaN
chi ONE  4.0  1.0
    TWO  NaN  5.0